1Cvgnqualitysmoke/src/Catalogs/ВидыТестирования/ВидыТестирования.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ВидыТестирования</name>
  <predefined>
    <items>
      <name>ABтестирование</name>
      <description>A/B-тестирование</description>
    </items>
    <items>
      <name>ДымовоеТестирование</name>
      <description>Дымовое тестирование</description>
    </items>
    <items>
      <name>КонфигурационноеТестирование</name>
      <description>Конфигурационное тестирование</description>
    </items>
    <items>
      <name>НагрузочноеТестирование</name>
      <description>Нагрузочное тестирование</description>
    </items>
    <items>
      <name>ПриемочноеТестирование</name>
      <description>Приемочное тестирование</description>
    </items>
    <items>
      <name>ПроверкаСтандартовКода</name>
      <description>Проверка стандартов кода</description>
    </items>
    <items>
      <name>ТестированиеБезопасности</name>
      <description>Тестирование безопасности</description>
    </items>
    <items>
      <name>ТестированиеДокументации</name>
      <description>Тестирование документации</description>
    </items>
    <items>
      <name>ФункциональноеТестирование</name>
      <description>Функциональное тестирование</description>
    </items>
    <items>
      <name>ЮзабилитиТестирование</name>
      <description>Юзабилити тестирование</description>
    </items>
  </predefined>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ЭтапыТестирования</name>
    <attributes>
      <name>ЭтапТестирования</name>
      <type>
        <types>CatalogRef.ЭтапыТестирования</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>НастройкиПрограммныхПродуктов</name>
    <attributes>
      <name>НастройкаПрограммныхПродуктов</name>
      <type>
        <types>CatalogRef.НастройкиПрограммныхПродуктов</types>
      </type>
    </attributes>
    <attributes>
      <name>Описание</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ЭтапТестирования</name>
      <type>
        <types>CatalogRef.ЭтапыТестирования</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

1Cvgnqualitysmoke/src/Catalogs/ВидыТестирования/Forms/ФормаЭлемента/Module.bsl
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	УстановитьОтборСтрок();

КонецПроцедуры

&НаКлиенте
Процедура ЭтапыТестированияПриАктивизацииСтроки(Элемент)
	
	УстановитьОтборСтрок();	
	
КонецПроцедуры  


&НаКлиенте
Процедура УстановитьОтборСтрок()
	
	ТекДанные =  Элементы.ЭтапыТестирования.ТекущиеДанные;
	
	Если НЕ ТекДанные = Неопределено Тогда
		
		СтруктураПоиска = Новый Структура;
		СтруктураПоиска.Вставить("ЭтапТестирования", ТекДанные.ЭтапТестирования);
		Элементы.НастройкиПрограммныхПродуктов.ОтборСтрок = Новый ФиксированнаяСтруктура(СтруктураПоиска);
		
	КонецЕсли;	
	
КонецПроцедуры  

&НаКлиенте
Процедура НастройкиПрограммныхПродуктовПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	ТекДанные =  Элементы.ЭтапыТестирования.ТекущиеДанные;
	
	Если  ТекДанные = Неопределено Тогда   
		
		Отказ = Истина;
		Сообщить("Необходимо выбрать этап тестирования");  
		
	Иначе
		
		Отказ = Истина;
		НовСтрока = Объект.НастройкиПрограммныхПродуктов.Добавить();
		НовСтрока.ЭтапТестирования = ТекДанные.ЭтапТестирования;
		
	КонецЕсли;
	
КонецПроцедуры
